; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v2 - type_3 ?v7 - type_1)
 	      (pred_2 ?v5 - object ?v7 - type_1)
	      (pred_3 ?v2 - type_3 ?v8 - type_2)
	      (pred_1 ?v2 - type_3 ?v5 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v2 - type_3 ?v4 ?v1 - type_1)
       :precondition (and  (pred_4 ?v2 ?v4))
       :effect (and  (pred_4 ?v2 ?v1)
		     (not (pred_4 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_3 ?v3 - object ?v6 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v2 ?v6) (pred_3 ?v2 ?v8))
       :effect (and (pred_1 ?v2 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_3 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_3 ?v3 - object ?v6 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v3 ?v8) (pred_4 ?v2 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_3 ?v2 ?v8)
		    (not (pred_1 ?v2 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_04 - type_3
obj_09 obj_07 obj_14 obj_02 - type_2
obj_03 obj_12 obj_05 obj_06 - type_1
obj_08 obj_13 obj_11 obj_01 - object)
(:init
(pred_4 obj_10 obj_12)
(pred_3 obj_10 obj_09)
(pred_3 obj_10 obj_07)
(pred_4 obj_04 obj_06)
(pred_3 obj_04 obj_14)
(pred_3 obj_04 obj_02)
(pred_2 obj_08 obj_12)
(pred_2 obj_13 obj_06)
(pred_2 obj_11 obj_06)
(pred_2 obj_01 obj_06)
)
(:goal
(and
(pred_2 obj_08 obj_12)
(pred_2 obj_13 obj_05)
(pred_2 obj_11 obj_03)
(pred_2 obj_01 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_10 obj_05)))
)
)

; plan
1. (op_1 obj_04 obj_13 obj_06 obj_02)
   deleted: (pred_2 obj_13 obj_06) (pred_3 obj_04 obj_02)
   added: (pred_1 obj_04 obj_13 obj_02)
   goals met: 1 of 4
2. (op_1 obj_04 obj_11 obj_06 obj_14)
   deleted: (pred_2 obj_11 obj_06) (pred_3 obj_04 obj_14)
   added: (pred_1 obj_04 obj_11 obj_14)
   goals met: 1 of 4
3. (op_2 obj_10 obj_12 obj_06)
   deleted: (pred_4 obj_10 obj_12)
   added: (pred_4 obj_10 obj_06)
   goals met: 1 of 4
4. (op_2 obj_04 obj_06 obj_05)
   deleted: (pred_4 obj_04 obj_06)
   added: (pred_4 obj_04 obj_05)
   goals met: 1 of 4
5. (op_1 obj_10 obj_01 obj_06 obj_07)
   deleted: (pred_2 obj_01 obj_06) (pred_3 obj_10 obj_07)
   added: (pred_1 obj_10 obj_01 obj_07)
   goals met: 1 of 4
6. (op_3 obj_04 obj_13 obj_05 obj_02)
   deleted: (pred_1 obj_04 obj_13 obj_02)
   added: (pred_2 obj_13 obj_05) (pred_3 obj_04 obj_02)
   goals met: 2 of 4
7. (op_2 obj_10 obj_06 obj_12)
   deleted: (pred_4 obj_10 obj_06)
   added: (pred_4 obj_10 obj_12)
   goals met: 2 of 4
8. (op_2 obj_04 obj_05 obj_03)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_03)
   goals met: 2 of 4
9. (op_3 obj_10 obj_01 obj_12 obj_07)
   deleted: (pred_1 obj_10 obj_01 obj_07)
   added: (pred_2 obj_01 obj_12) (pred_3 obj_10 obj_07)
   goals met: 3 of 4
10. (op_3 obj_04 obj_11 obj_03 obj_14)
   deleted: (pred_1 obj_04 obj_11 obj_14)
   added: (pred_2 obj_11 obj_03) (pred_3 obj_04 obj_14)
   goals met: 4 of 4
